Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This property must be set to identify a private signing key if `smallrye.jwt.sign.key.location` points to a `KeyStore` file.
ja_jp: このプロパティは、 `smallrye.jwt.sign.key.location` が `KeyStore` ファイルを指している場合、秘密署名鍵を特定するために設定する必要があります。

source: This property must be set to identify the public encryption key that is extracted from `KeyStore` from a matching certificate if `smallrye.jwt.encrypt.key.location` points to a `KeyStore` file.
ja_jp: `smallrye.jwt.encrypt.key.location` が `KeyStore` ファイルを指している場合、一致する証明書の `KeyStore` から抽出された公開暗号鍵を識別するには、このプロパティーを設定する必要があります。

source: This property only works during a normal production build (i.e. not for dev mode/tests) and when `fast-jar` packaging type is used (the default behavior).
ja_jp: このプロパティは、通常のプロダクションビルド時にのみ機能します（つまり、devモード/テストでは機能しません）。また、 `fast-jar` パッケージングタイプが使用されている場合（デフォルトの動作）には、このプロパティは機能しません。

source: This property sets the JSON log format for the console.
ja_jp: このプロパティーは、コンソールの JSON ログフォーマットを設定します。

source: This property sets the maximum time to wait for all Dev Services to start. The default is 60 seconds.
ja_jp: このプロパティーは、すべての Dev Services が起動するまでに待機する最大時間を設定します。デフォルトは 60 秒です。

source: This provider may be used in a datasource definition like this:
ja_jp: このプロバイダは、次のようなデータソースの定義で使用することができます。

source: This provides `io.quarkus.test.keycloak.server.KeycloakTestResourceLifecycleManager` - an implementation of `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` which starts a Keycloak container.
ja_jp: これは、Keycloak コンテナーを起動する `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` の実装である `io.quarkus.test.keycloak.server.KeycloakTestResourceLifecycleManager` を提供します。

source: This provides `io.quarkus.test.keycloak.server.KeycloakTestResourceLifecycleManager`, an implementation of `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` that starts a Keycloak container.
ja_jp: これは、Keycloak コンテナーを起動する `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` の実装である `io.quarkus.test.keycloak.server.KeycloakTestResourceLifecycleManager` を提供します。

source: This provides a Quarkus Dev service using an "all-in-one" https://github.com/grafana/docker-otel-lgtm[Grafana OTel LGTM].
ja_jp: これは、"オールインワン" の https://github.com/grafana/docker-otel-lgtm[Grafana OTel LGTM] を使用して Quarkus Dev サービスを提供します。

source: This provides a fast and focused troubleshooting workflow without needing to copy and paste logs manually.
ja_jp: これにより、ログを手動でコピー & ペーストすることなく、迅速かつ集中したトラブルシューティングのワークフローが提供されます。

source: This provides an easy way to visualize all OpenTelemetry data generated by the application.
ja_jp: これにより、アプリケーションが生成したすべての OpenTelemetry データを簡単に可視化できます。

source: This provides type safety across all transports, a single source of truth for the protocol, and clean separation between wire format and API without cluttering domain classes with serialization annotations.
ja_jp: これにより、すべてのトランスポートで型安全性、プロトコルの信頼できる唯一の情報源、およびシリアライゼーションアノテーションでドメインクラスを煩雑にすることなく、ワイヤーフォーマットとAPIのクリーンな分離が提供されます。

source: This query will allow the client to retrieve the film by id, and the `@Name` annotation on the parameter changes the parameter name to `filmId` rather than the default `id` that it would be if you omit the `@Name` annotation.
ja_jp: このクエリでは、クライアントが映画をIDで検索することができます。また、パラメータに `@Name` のアノテーションを付けると、パラメータ名が `@Name` のアノテーションを省略した場合のデフォルトの `id` ではなく、 `filmId` に変更されます。

source: This quickstart demonstrates how to use `OpenID Connect Client Reactive Filter` to acquire and propagate access tokens as `HTTP Authorization Bearer` access tokens, alongside `OpenID Token Propagation Reactive Filter` which propagates the incoming `HTTP Authorization Bearer` access tokens.
ja_jp: このクイックスタートでは、 `OpenID Connect Client Reactive Filter` を使用して、アクセストークンを `HTTP Authorization Bearer` アクセストークンとして取得および伝播する方法と、受信した `HTTP Authorization Bearer` アクセストークンを伝播する `OpenID Token Propagation Reactive Filter` を使用する方法を示します。

source: This quickstart guide shows how to build a REST application using the link:https://github.com/datastax/cassandra-quarkus[Cassandra Quarkus extension], which allows you to connect to an Apache Cassandra, DataStax Enterprise (DSE) or DataStax Astra database, using the link:https://docs.datastax.com/en/developer/java-driver/latest[DataStax Java driver].
ja_jp: このクイックスタート・ガイドでは、 link:https://docs.datastax.com/en/developer/java-driver/latest[DataStax Javaドライバー]を使用してApache Cassandra、DataStax Enterprise（DSE）、またはDataStax Astraデータベースに接続できる link:https://github.com/datastax/cassandra-quarkus[Cassandra Quarkusエクステンション]を使用してRESTアプリケーションを構築する方法を説明します。

source: This reads as: "Listen on `$PORT` if this is a defined variable, otherwise listen on 8080 as usual." Run the following to add this to your `application.properties`:
ja_jp: これは、「定義済みの変数の場合は `$PORT` をリッスンし、それ以外の場合は通常通り 8080 をリッスンする」と読み取れます。 以下を実行して、これを `application.properties` に追加します。

source: This recorder method results in an invocation upon the `Foo` bean instance and thus we need to make sure that the build step is executed after all synthetic beans are initialized.
ja_jp: このレコーダーメソッドでは `Foo` Bean インスタンスが呼び出されるため、必ずすべての合成 Bean が初期化された後にビルドステップが実行されることを確認する必要があります。

source: This reduces the overhead of having an independent Micrometer registry plus the OpenTelemetry SDK in memory for the same application when both `quarkus-micrometer` and `quarkus-opentelemetry` extensions are used independently.
ja_jp: これにより、`quarkus-micrometer` エクステンションと `quarkus-opentelemetry` エクステンションの両方が独立して使用される場合に、同じアプリケーションに対して独立した Micrometer レジストリーと OpenTelemetry SDK をメモリー内に保持することによるオーバーヘッドが削減されます。

source: This reference covers how to write applications that run and then exit.
ja_jp: このリファレンスでは、実行して終了するアプリケーションの書き方について説明しています。

source: This reference guide covers the `QuarkusComponentTestExtension`, a JUnit extension to ease the testing of components and mocking of their dependencies.
ja_jp: このリファレンスガイドは `QuarkusComponentTestExtension` を扱います。これはコンポーネントのテストと依存関係のモックを簡単にする JUnit エクステンションです。

source: This reference guide demonstrates how your Quarkus application can utilize Quarkus Messaging to interact with Apache Kafka.
ja_jp: このリファレンスガイドでは、Quarkus アプリケーションが Quarkus Messaging を利用して Apache Kafka と対話する仕組みを説明します。

source: This reference guide demonstrates how your Quarkus application can utilize Quarkus Messaging to interact with Apache Pulsar.
ja_jp: このリファレンスガイドでは、Quarkus アプリケーションが Quarkus Messaging を利用して Apache Pulsar と対話する仕組みを説明します。

source: This reference guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with Apache Kafka.
ja_jp: このガイドでは、Quarkus アプリケーションが SmallRye Reactive Messaging を利用して Apache Kafka とやりとりする仕組みを説明します。

source: This reference guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with Apache Pulsar.
ja_jp: このリファレンス・ガイドでは、QuarkusアプリケーションがSmallRye Reactive Messagingを利用してApache Pulsarと対話する方法を説明します。

source: This reference guide explains how to configure gRPC code generation. It is recommended to read the xref:grpc.adoc[official gRPC guide] first.
ja_jp: このリファレンスガイドでは、gRPC コード生成を設定する方法について説明します。最初に xref:grpc.adoc[gRPC 公式ガイド] を読むことを推奨します。

source: This reference guide explains how to configure initialization tasks
ja_jp: このリファレンスガイドでは、初期化タスクの設定方法について説明します。

source: This reference guide explains how to develop command line applications with Quarkus.
ja_jp: このリファレンスガイドでは、Quarkusを使用してコマンドラインアプリケーションを開発する方法について説明しています。

source: This reference guide explains how to enable AppCDS with Quarkus.
ja_jp: このリファレンスガイドでは、QuarkusでAppCDSを有効化する方法について説明しています。

source: This reference guide explains how to enable Application Class Data Sharing in your Quarkus applications.
ja_jp: このリファレンスガイドでは、Quarkusアプリケーションでアプリケーションクラスデータ共有（AppCDS）を有効にする方法について説明します。

source: This reference guide explains how to use:
ja_jp: このリファレンスガイドは、以下の使用方法について説明しています。

source: This reference guide explains in more details the configuration and usage of the Quarkus Mailer.
ja_jp: このリファレンスガイドでは、Quarkus Mailerの設定、使用方法について詳しく説明しています。

source: This reference guide provides advanced details about the usage and the configuration of the Vert.x instance used by Quarkus.
ja_jp: このリファレンスガイドは、Quarkusが使用するVert.xインスタンスの使用方法と設定に関する高度な詳細を提供します。

source: This reference guide provides an in-depth look on Apache Kafka and Quarkus Messaging extensions.
ja_jp: このリファレンスガイドでは、Apache KafkaとQuarkus Messagingエクステンションについて詳しく説明します。

source: This reference guide provides an in-depth look on Apache Kafka and Smallrye Reactive Messaging framework.
ja_jp: このリファレンスガイドでは、Apache KafkaとSmallrye Reactive Messagingフレームワークについて詳しく説明しています。

source: This reference guide provides an in-depth look on Apache Pulsar and Smallrye Reactive Messaging framework.
ja_jp: このリファレンス・ガイドは、Apache PulsarとSmallryeリアクティブ・メッセージング・フレームワークを詳しく紹介します。

source: This reference guide provides an in-depth look on Apache Pulsar and the Quarkus Messaging extensions.
ja_jp: このリファレンス・ガイドでは、Apache PulsarとQuarkus Messagingエクステンションについて詳しく説明します。

source: This reference guide takes as input the application developed in the xref:getting-started.adoc[Getting Started Guide]. You can find instructions on how to quickly set up this application in this guide.
ja_jp: このリファレンスガイドは、xref:getting-started.adoc[スタートガイド] で開発されたアプリケーションを入力としています。このガイドでは、このアプリケーションをすばやくセットアップする方法について説明しています。

source: This release adds support for CodeLens for REST endpoints and enhances MicroProfile Fault Tolerance and Metrics supports
ja_jp: このリリースでは、CodeLens for RESTエンドポイントのサポートが追加され、MicroProfile Fault ToleranceとMetricsのサポートが強化されています。

source: This release adds support for Quarkus run/debug configurations
ja_jp: このリリースでは、Quarkusの実行/デバッグ構成のサポートが追加されました。

source: This release adds support for Quarkus streams in the new project/module wizard
ja_jp: このリリースでは、新しいプロジェクト/モジュールウィザードにQuarkus streamsのサポートが追加されました。

source: This release adds support for Qute templates
ja_jp: このリリースでは、Quteテンプレートのサポートが追加されています。

source: This release also includes internal changes and refactorings that will bear fruits in future versions.
ja_jp: このリリースには、将来のバージョンで実を結ぶ内部的な変更とリファクタリングも含まれています。

source: This release brings several new features:
ja_jp: 今回のリリースでは、いくつかの新機能が追加されました。

source: This release comes with a lot of improvements to our security extensions, including:
ja_jp: このリリースには、当社のセキュリティエクステンションに対する多くの改善が含まれており、以下を含みます:

source: This release contains a brand new feature improving developer productivity: Continuous Testing. This allows tests to be run automatically in development mode, and can be enabled by pressing `r` in the console (or through the Dev UI). If you enable testing, your test suite will be run once at the start, and then continuous testing will run your tests as you are coding, and tell you if your changes will break any tests. This will give you instant feedback on your changes, without having to switch to a browser. As much as possible we only run tests that are relevant to the code that has been changed.
ja_jp: このリリースには、開発者の生産性を向上させる全く新しい機能が含まれています。継続的テストです。この機能は、開発モードでテストを自動的に実行できるようにするもので、コンソール（または Dev UI）で `r` を押すと有効になります。テストを有効にすると、最初にテストスイートが一度だけ実行され、その後はコーディング中に継続的テストがテストを実行し、変更によってテストが壊れるかどうかを教えてくれます。これにより、ブラウザに切り替えることなく、変更内容を即座にフィードバックすることができます。可能な限り、変更されたコードに関連するテストのみを実行します。

source: This release contains an Alpha implementation of Continuous Testing. This allows tests to be run in development mode, and can be enabled by pressing 'e' in the console (or through the Dev UI). If you enable testing, your test suite will be run once at the start, and then continuous testing will run your tests as you are coding, and tell you if your changes will break any tests. This will give you instant feedback on your changes, without having to switch to a browser. As much as possible we only run tests that are relevant to the code that has been changed.
ja_jp: このリリースには、継続的テストのアルファ版の実装が含まれています。これにより、開発モードでもテストを実行できるようになり、コンソールで「e」を押すことで（または Dev UI で）有効にすることができます。テストを有効にすると、テストスイートは最初に一度だけ実行され、その後はコーディング中に継続的テストがテストを実行し、変更によってテストが壊れるかどうかを教えてくれます。これにより、ブラウザに切り替えることなく、変更内容を即座にフィードバックすることができます。可能な限り、変更されたコードに関連するテストのみを実行します。

source: This release contains bugfixes, documentation updates and fixes the following CVEs:
ja_jp: このリリースには、バグ修正、ドキュメントの更新、および以下の CVE に対する修正が含まれています。

source: This release includes additional features like the <code>quarkus deploy</code> command that enables the deployment of Quarkus applications to platforms like Kubernetes, Knative, and OpenShift without requiring changes to the project dependencies or configuration
ja_jp: このリリースには、<code>quarkus deploy</code>コマンドなどの追加機能があり、プロジェクトの依存関係や設定の変更を必要とせずに、QuarkusアプリケーションをKubernetes、Knative、OpenShiftなどのプラットフォームに展開できるようになります。

source: This release includes breaking changes to align with the latest A2A specification.
ja_jp: このリリースには、最新の A2A 仕様に準拠するための破壊的変更が含まれています。

source: This release includes several important enhancements and breaking changes:
ja_jp: このリリースには、いくつかの重要な機能強化と破壊的変更が含まれています。

source: This release is a maintenance release that fixes various bugs found in 1.8.0.Final and provides some documentation updates.
ja_jp: このリリースは、1.8.0.Final で発見された様々なバグを修正し、いくつかのドキュメントを更新するメンテナンスリリースです。

source: This release is a maintenance release that fixes various bugs found in 1.8.1.Final and provides some documentation updates.
ja_jp: このリリースは、1.8.1.Final で発見された様々なバグを修正し、いくつかのドキュメントの更新を提供するメンテナンスリリースです。

source: This release is a maintenance release that fixes various bugs found in 1.8.2.Final and provides some documentation updates.
ja_jp: このリリースは、1.8.2.Final で発見された様々なバグを修正し、ドキュメントを更新したメンテナンスリリースです。

source: This release is a maintenance release that fixes various bugs found in 1.9.0.Final and provides some documentation updates.
ja_jp: このリリースは、1.9.0.Finalで見つかったさまざまなバグを修正し、いくつかのドキュメントを更新したメンテナンスリリースです。

source: This release is a maintenance release.
ja_jp: このリリースはメンテナンスリリースです。

source: This release is packed with new features and improvements, including full Java 25 support, a new Quarkus Maven packaging type, Panache Next, Hibernate upgrades, JUnit 6 and Testcontainers 2 upgrades, and numerous enhancements to our Security extensions.
ja_jp: このリリースには、フルJava 25サポート、新しいQuarkus Mavenパッケージングタイプ、Panache Next、Hibernateのアップグレード、JUnit 6とTestcontainers 2のアップグレード、およびセキュリティエクステンションへの多数の機能強化など、新機能と改善が満載されています。

source: This requires also to add into the application all certificates for all environments (e.g. DEV, TEST, PROD), which means that a certificate that is required for DEV but should not be used elsewhere, will make its way anyway in production.
ja_jp: このため、すべての環境（DEV、TEST、PRODなど）に対応したすべての証明書をアプリケーションに追加する必要があります。つまり、DEVでは必要だが他の場所では使用してはいけない証明書が、本番環境ではそのまま使用されてしまうということです。

source: This requires also to add into the application all certificates for all environments (e.g. `dev`, `test`, `prod`), which means that a certificate that is required for dev mode but should not be used elsewhere, will make its way anyway in production.
ja_jp: これは、すべての環境（例： `dev` 、 `test` 、 `prod` ）に対応するすべての証明書をアプリケーションに追加する必要があることを意味します。つまり、開発モードでは必要だが、他の場所では使用すべきでない証明書が、本番環境では結果として含まれてしまうことになります。

source: This resource creates a `WebClient` and, upon request, uses this client to invoke a remote HTTP API. Depending on the result, the response is forwarded as received, or it creates a JSON object wrapping the error. The `WebClient` is asynchronous (and non-blocking), to the endpoint returns a `Uni`.
ja_jp: このリソースは、 `WebClient` を作成し、リクエストに応じて、このクライアントを使用してリモート HTTP API を呼び出します。結果に応じて、レスポンスは受信したまま転送されるか、エラーをラップしたJSONオブジェクトが作成されます。 `WebClient` は非同期（かつノンブロッキング）で、エンドポイントからは `Uni` が返されます。

source: This resource returns information obtained from the Access Token issued by the OIDC provider about the authenticated user and the current tenant.
ja_jp: このリソースは、認証されたユーザーと現在のテナントについて、OIDC プロバイダーによって発行された Access Token から取得した情報を返します。

source: This resource returns information obtained from the Access token issued by OpenID Provider about the authenticated user and the current tenant.
ja_jp: OpenID Providerが発行するアクセストークンから取得した、認証されたユーザと現在のテナントに関する情報を返すリソースです。

source: This resource returns information obtained from the ID token issued by OpenID Provider about the authenticated user and the current tenant.
ja_jp: OpenID Providerが発行するIDトークンから取得した、認証されたユーザと現在のテナントに関する情報を返すリソースです。

source: This resource returns information obtained from the ID token issued by the OIDC provider about the authenticated user and the current tenant.
ja_jp: このリソースは、認証されたユーザーと現在のテナントについて、OIDC プロバイダーによって発行された ID トークンから取得した情報を返します。

source: This response is produced by Quarkus via a builtin implementation of `jakarta.ws.rs.ext.ExceptionMapper`. If the application code needs to handle `ValidationException` in some custom way, it can provide an implementation of `jakarta.ws.rs.ext.ExceptionMapper` like so:
ja_jp: このレスポンスはQuarkusによって、 `jakarta.ws.rs.ext.ExceptionMapper` の組み込み実装によって生成されます。アプリケーションコードが何らかのカスタム方法で `ValidationException` を処理する必要がある場合、 `jakarta.ws.rs.ext.ExceptionMapper` の実装を提供することができます：

source: This response is sent back using the reply mechanism
ja_jp: このレスポンスは、応答メカニズムによって返信されます。

source: This restores the default JNDI-based resolution mechanism used by the MongoDB driver.
ja_jp: これは MongoDB ドライバが使うデフォルトの JNDI ベースの解決メカニズムを復元します。

source: This results in an archive generation process that on one hand is completely safe, but on the other hand is unable to archive every single class that the application might need at boot time. As a result, users are expected to get a slightly more effective archive if they manually go through the hoops of generating the AppCDS archive.
ja_jp: この結果、アーカイブ生成プロセスは、一方では完全に安全ですが、他方では、アプリケーションが起動時に必要となるかもしれないありとあらゆるクラスをアーカイブすることはできません。その結果、ユーザーは手動でAppCDSアーカイブを生成することで、わずかに効果的なアーカイブを取得することが期待できます。

source: This results in an archive generation process that, on one hand, is completely safe, but on the other hand, is unable to archive every single class that the application might need at boot time. As a result, users are expected to get a slightly more effective archive if they manually go through the hoops of generating the AppCDS archive.
ja_jp: この結果、アーカイブ生成プロセスは、一方では完全に安全ですが、他方では、アプリケーションが起動時に必要とする可能性のあるすべてのクラスをアーカイブすることはできません。その結果、手動で AppCDS アーカイブを生成する手間をかけると、ユーザーはわずかに効果的なアーカイブを取得できると期待されます。

source: This results in the following dev mode URLs:
ja_jp: その結果、以下のような開発モードのURLになります。

source: This returns a 204 with no body.
ja_jp: これは、ボディを持たない204を返却します

source: This returns a 302 redirect to the root URI of your application.
ja_jp: これは、アプリケーションのルートURIへの302リダイレクトを返します。

source: This root path can be customized with `quarkus.http.non-application-root-path`.
ja_jp: このルートパスは、 `quarkus.http.non-application-root-path`.

source: This rule is further exemplified by a scenario where subpath permission allows access to a public resource while the root path permission necessitates authorization.
ja_jp: このルールをさらに例示するために、サブパス権限ではパブリックリソースへのアクセスを許可し、ルートパス権限では認可を要求するシナリオを示します。

source: This rules file must declare the same package and a unit with the same name of the Java class implementing the `RuleUnitData` interface in order to state that they belong to the same rule unit.
ja_jp: このルールファイルでは、同じルールユニットに属していることを示すために、 `RuleUnitData` インターフェイスを実装する Java クラスと同じパッケージと、同じ名前のユニットを宣言する必要があります。

source: This same SPI can also be used to provide a custom annotation that will substitute for `@RecordableConstructor`.
ja_jp: この同じSPIを使用して、 `@RecordableConstructor` の代わりになるカスタムアノテーションを提供することも可能です。

source: This same demo can be compiled into native code. No modifications are required.
ja_jp: この同じデモをネイティブ・コードにコンパイルすることができます。修正は必要ありません。

source: This same demo can be compiled into native code: no modifications required.
ja_jp: 同じデモをネイティブコードにコンパイルすることができます。

source: This same demo can be compiled into native code; no modifications are required.
ja_jp: この同じデモはネイティブコードにコンパイルできます。変更は必要ありません。

source: This scope is backed by a `jakarta.servlet.http.HttpSession` object. It's only available if the `quarkus-undertow` extension is used.
ja_jp: このスコープは `jakarta.servlet.http.HttpSession` オブジェクトによってバックアップされています。 `quarkus-undertow` エクステンションを使用している場合のみ利用可能です。

source: This scope is backed by a `javax.servlet.http.HttpSession` object. It's only available if the `quarkus-undertow` extension is used.
ja_jp: このスコープは `javax.servlet.http.HttpSession` オブジェクトによってバックアップされています。 `quarkus-undertow` エクステンションを使用している場合のみ利用可能です。

source: This secret key JWK must also be referred to with `smallrye.jwt.verify.key.location`. `smallrye.jwt.verify.algorithm` should be set to `HS256`/`HS384`/`HS512`.
ja_jp: この秘密鍵 JWK は、 `smallrye.jwt.verify.key.location` でも参照する必要があります。 `smallrye.jwt.verify.algorithm` は `HS256`/`HS384`/`HS512` に設定する必要があります。

source: This secret key JWK will also need to be referred to with `smallrye.jwt.verify.key.location`. `smallrye.jwt.verify.algorithm` should be set to `HS256`/`HS384`/`HS512`.
ja_jp: この秘密鍵 JWK も、 `smallrye.jwt.verify.key.location` で参照する必要があります。 `smallrye.jwt.verify.algorithm` は `HS256`/`HS384`/`HS512` に設定する必要があります。

source: This section allows you to define named local variables.
ja_jp: このセクションでは、名前付きのローカル変数を定義できます。

source: This section allows you to define named local variables:
ja_jp: このセクションでは、名前付きローカル変数を定義することができます。

source: This section can be used to include another template and possibly override some parts of the template (see the _template inheritance_ below).
ja_jp: このセクションは、別のテンプレートをインクルードし、場合によってはテンプレートの一部をオーバーライドするために使用することができます (下記の _テンプレートの継承_ を参照)。

source: This section can be used to include another template and possibly override some parts of the template (template inheritance).
ja_jp: このセクションでは、別のテンプレートをインクルードしたり、テンプレートの一部をオーバーライドすることができます(テンプレートの継承)。

source: This section can be used to parse and evaluate a template dynamically. The behavior is very similar to <<include_helper>> but:
ja_jp: このセクションは、テンプレートを動的に解析および評価するために使用できます。 動作は <<include_helper>> によく似ています。ただし、

source: This section can be used to parse and evaluate a template dynamically. The behavior is very similar to the <<include_helper>> but:
ja_jp: このセクションは、テンプレートを動的に解析および評価するために使用することができます。動作は <<include_helper>> に非常に似ています。ただし、

source: This section can be used to parse and evaluate a template dynamically. The behavior is very similar to xref:include_helper[Include Section] but:
ja_jp: このセクションは、テンプレートを動的に解析し、評価するために使用することができます。動作は xref:include_helper[インクルードセクション] に非常に似ていますが:

source: This section can be used to set the current context object. This could be useful to simplify the template structure:
ja_jp: このセクションは、現在のコンテキストオブジェクトを設定するために使用することができます。これはテンプレート構造を単純化するのに便利かもしれません。

source: This section discusses these considerations.
ja_jp: このセクションでは、これらの考慮事項について説明します。

source: This section explains how to configure the default trust store when building a native executable. However, it is **strongly recommended** to use the xref:./tls-registry-reference.adoc[TLS registry] instead. The TLS registry ensures a consistent experience and feature set across both JVM and native modes.
ja_jp: このセクションでは、ネイティブ実行ファイルをビルドする際にデフォルトのトラストストアを設定する方法を説明します。 しかし、代わりに xref:./tls-registry-reference.adoc[TLSレジストリ] を使うことを *強く推奨します* 。 TLSレジストリを使用することで、JVMモードとネイティブ・モードの両方で一貫した使用感と機能セットが保証されます。

source: This section explains how to connect to notorious Kafka Cloud Services.
ja_jp: このセクションでは、ちょっとクセのある Kafka Cloud Services に接続する方法について説明します。

source: This section gives an example using the Vert.x `WebClient` in the context of a Quarkus REST (formerly RESTEasy Reactive) application. As indicated in the table above, add the following dependency to your project:
ja_jp: このセクションでは、Quarkus REST (旧称 RESTEasy Reactive) アプリケーションのコンテキストで Vert.x `WebClient` を使用する例を示します。 上記の表に示されているように、プロジェクトに次の依存関係を追加します。

source: This section gives an example using the Vert.x `WebClient` in the context of a RESTEasy Reactive application. As indicated in the table above, add the following dependency to your project:
ja_jp: このセクションでは、RESTEasy Reactiveアプリケーションの文脈でVert.x `WebClient` を使った例を紹介します。上の表にあるように、プロジェクトに以下の依存関係を追加します。
